#-----------------------------------------------------------
# PCS/PMA constraints not generated by Vivado in sgmii.xdc -
#-----------------------------------------------------------

create_clock -period 8.000 -name gtrefclk [get_pins -hier *ibufds_gtrefclk/O]
set_propagated_clock [get_clocks gtrefclk]

set_propagated_clock [get_clocks *TXOUTCLK*]

set_propagated_clock [get_clocks *RXOUTCLK*]

set_max_delay -from [get_clocks -include_generated_clocks *clk_pll_i*] -to [get_clocks {gtrefclk *RXOUTCLK*}] 8.000
set_max_delay -from [get_clocks -include_generated_clocks *clk_pll_i*] -to [get_clocks -include_generated_clocks *TXOUTCLK*] 8.000
set_max_delay -from [get_clocks gtrefclk] -to [get_clocks -include_generated_clocks *clk_pll_i*] 8.000
set_max_delay -from [get_clocks -include_generated_clocks *TXOUTCLK*] -to [get_clocks -include_generated_clocks *clk_pll_i*] 8.000
set_max_delay -from [get_clocks *RXOUTCLK*] -to [get_clocks -include_generated_clocks *clk_pll_i*] 8.000

set_max_delay -from [get_clocks gtrefclk] -to [get_clocks {*TXOUTCLK* *RXOUTCLK*}] 8.000
set_max_delay -from [get_clocks -include_generated_clocks *TXOUTCLK*] -to [get_clocks {gtrefclk *RXOUTCLK*}] 8.000
set_max_delay -from [get_clocks *RXOUTCLK*] -to [get_clocks gtrefclk] 8.000
set_max_delay -from [get_clocks *RXOUTCLK*] -to [get_clocks -include_generated_clocks *TXOUTCLK*] 8.000

#set_false_path -to [get_pins -hier -filter {name =~ *gpcs_pma_inst/MGT_RESET.RESET_INT_*/PRE }]




